src/cf/Catalogs/Счета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Счета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ЗаблокированныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаблокированныеСчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Счета/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)

	ДатаСоздания = ТекущаяДатаСеанса();

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если НЕ ЭтоНовый() Тогда

		ЕстьИзмененияКлючевыхРеквизитов = Ложь;

		мРеквизиты = Новый Массив;
		мРеквизиты.Добавить("НаименованиеПолное");
		мРеквизиты.Добавить("Сумма");	

		ТекущиеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтрСоединить(мРеквизиты, ", "));

		Для Каждого ИмяРеквизита Из мРеквизиты Цикл
			Если ТекущиеЗначенияРеквизитов[ИмяРеквизита] <> ЭтотОбъект[ИмяРеквизита] Тогда
				ЕстьИзмененияКлючевыхРеквизитов = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ЕстьИзмененияКлючевыхРеквизитов Тогда

			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ЗаблокированныеСчета.Счет КАК НовыйСправочник
			|ИЗ
			|	РегистрСведений.ЗаблокированныеСчета КАК ЗаблокированныеСчета
			|ГДЕ
			|	ЗаблокированныеСчета.Счет = &Ссылка";

			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				ТекстСообщения = "Счет заблокирован. Перед изменением ключевых реквизитов, счет необходимо разблокировать.";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
